
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	
	Элементы.СтраницаВходящийТекст.Видимость = Объект.ВидВходящегоОбновления = ПредопределенноеЗначение("Перечисление.ТелеграмВидыВходящихОбновлений.Сообщение");
	Элементы.СтраницаВходящиеДанные.Видимость = Объект.ВидВходящегоОбновления = ПредопределенноеЗначение("Перечисление.ТелеграмВидыВходящихОбновлений.ОтветКонтекстнойКлавиатуры");
	
КонецПроцедуры


&НаКлиенте
Процедура ВидВходящегоОбновленияПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры
