&НаКлиенте
Процедура ПанельПолученияОбновлений(Команда)
	
	Элементы.ФормаПанельПолученияОбновлений.Пометка = НЕ Элементы.ФормаПанельПолученияОбновлений.Пометка;
	УстановитьВидимостьДоступность();
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	
	Элементы.ГруппаПанельПолученияОбновлений.Видимость = Элементы.ФормаПанельПолученияОбновлений.Пометка;
	
КонецПроцедуры


&НаКлиенте
Процедура ПолучениеОбновленийПриИзменении(Элемент)
	
	ПодключитьОтключитьОбработчикОжидания();
	
КонецПроцедуры


&НаКлиенте
Процедура ПериодичностьПриИзменении(Элемент)
	
	ПодключитьОтключитьОбработчикОжидания();
	
КонецПроцедуры


&НаКлиенте
Процедура ПодключитьОтключитьОбработчикОжидания()
	
	Если ПолучениеОбновлений = Истина Тогда
		ПодключитьОбработчикОжидания("ПолучениеОбновлений", Периодичность, Ложь);
	Иначе
		ОтключитьОбработчикОжидания("ПолучениеОбновлений");
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПолучениеОбновлений()
	
	ПолучениеОбновленийСервер();
	ПоследнееПолучение = ТекущаяДата();
	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ПолучениеОбновленийСервер()

	ТелеграмСервер.ПолучитьОбновленияБота();

КонецПроцедуры

